
{
  "kolky": {
    "term": "Kolky",
    "definition": "Гербові марки, що використовуються в Чеській Республіці для адміністративних платежів. Їх можна придбати на будь-якому поштовому відділенні в різних номіналах. Вважайте їх передоплаченою квитанцією за офіційні збори."
  },
  "SOLUS":{
    "term": "SOLUS",
    "definition":"Реєстр боржників, який використовується банками та небанківськими установами для перевірки кредитної історії клієнтів."
  },
  "kauce":{
    "term": "kauce",
    "definition": "Застава за оренду, яку орендар сплачує орендодавцю для забезпечення можливих збитків майну або несплаченої орендної плати. Зазвичай це сума, що відповідає одному-трьом місяцям оренди."
  },
  "registr-obyvatel": {
    "term": "Registr obyvatel",
    "definition": "Офіційний Реєстр мешканців Чеської Республіки, який веде Міністерство внутрішніх справ. Він містить основну юридичну інформацію про всіх жителів."
  },
  "matricni-doklad": {
    "term": "Matriční doklad",
    "definition": "Чеський документ про цивільний стан, такий як свідоцтво про народження або свідоцтво про шлюб. Ці документи є основним джерелом вашої офіційної ідентичності в чеській системі."
  },
  "ministry-of-interior": {
    "term": "Ministry of the Interior",
    "definition": "Міністерство внутрішніх справ Чеської Республіки (Ministerstvo vnitra) є центральним державним органом, відповідальним за державне управління, включаючи питання, пов'язані з проживанням іноземців, документами, що посвідчують особу, та імміграцією.<br/><br/><strong>Корисні посилання:</strong><br/><a href=\"/guides/bureaucracy/how-to-get-a-foreigner-police-appointment\" class=\"text-primary underline\">Як записатися на прийом</a><br/><a href=\"/guides/bureaucracy/how-the-immigration-office-works\" class=\"text-primary underline\">Як працює імміграційне управління</a>"
  },
  "zdravotni-pojisteni": {
    "term": "Zdravotní pojištění",
    "definition": "Медичне страхування. Воно є обов'язковим для всіх жителів Чехії. Може бути державним (veřejné) або приватним (komerční), залежно від вашого статусу проживання та працевлаштування."
  },
  "verejne-zdravotni-pojisteni": {
    "term": "Veřejné zdravotní pojištění",
    "definition": "Державне медичне страхування. Це державна система медичного страхування, до якої належить більшість працівників, постійних мешканців та громадян ЄС."
  },
  "komercni-zdravotni-pojisteni": {
    "term": "Komerční zdravotní pojištění",
    "definition": "Приватне або комерційне медичне страхування. Воно є обов'язковим для більшості громадян країн, що не входять до ЄС, які не є постійними мешканцями, наприклад, для фрілансерів або студентів."
  },
  "autopojisteni": {
    "term": "Autopojištění",
    "definition": "Автострахування. Загальний термін для страхування, пов'язаного з транспортним засобом."
  },
  "povinne-ruceni": {
    "term": "Povinné ručení",
    "definition": "Обов'язкове страхування цивільно-правової відповідальності власників транспортних засобів. Воно покриває збитки, які ви можете завдати майну або здоров'ю інших людей. Їздити без нього незаконно."
  },
  "havarijni-pojisteni": {
    "term": "Havarijní pojištění",
    "definition": "Необов'язкове страхування від зіткнень або комплексне автострахування (КАСКО). Воно покриває пошкодження вашого власного автомобіля внаслідок аварії, крадіжки, вандалізму або стихійних лих."
  },
  "pojisteni-odpovednosti": {
    "term": "Pojištění odpovědnosti",
    "definition": "Страхування цивільної відповідальності. Воно покриває випадкові збитки, завдані вами майну або здоров'ю інших людей у повсякденному житті (не пов'язані з керуванням автомобілем). Дуже рекомендується і зазвичай дуже доступне."
  },
  "pojisteni-domacnosti": {
    "term": "Pojištění domácnosti",
    "definition": "Страхування домашнього майна. Воно покриває ваші особисті речі всередині будинку (меблі, електроніку тощо) від таких ризиків, як крадіжка, пожежа або пошкодження водою. Зазвичай його оформлює орендар."
  },
  "pojisteni-nemovitosti": {
    "term": "Pojištění nemovitosti",
    "definition": "Страхування нерухомості. Воно покриває саму фізичну конструкцію будівлі (стіни, дах, вікна). Зазвичай його оформлює орендодавець або власник нерухомості."
  },
  "pojisteni-pravni-ochrany": {
    "term": "Pojištění právní ochrany",
    "definition": "Юридичне страхування. Воно покриває витрати на юридичні спори, такі як гонорари адвокатів та судові витрати. Може бути корисним у питаннях з орендодавцями, роботодавцями або іншими договорами."
  }
}
